In [81]:
import pandas as pd

In [82]:
dataset = pd.read_csv("Salesprofit.csv")

In [83]:
dataset

   Administration   Marketing        R&D       State     Profit
0        185349.56  136897.44  201784.33  California  192261.11
1        182697.33  151377.55  243898.00     Florida  201792.01
2        183441.22  101145.11  217934.01     Newyork  211050.00
3        174372.00  118671.00  183199.00  California  182901.00
4        172107.00   15391.77  166168.00     Newyork  156187.00
5        188050.00  147398.00  301783.00     Florida  242050.00
6        198050.00  158098.00  351884.00     Florida  272050.00
7        208050.00  162050.00  364321.33     Newyork  294080.00

In [84]:
dataset.columns

Index(['Administration ', 'Marketing', 'R&D', 'State', 'Profit'], dtype='object')

In [85]:
dataset = pd.get_dummies(dataset,drop_first=True)

In [86]:
dataset

,Administration,Marketing,R&D,Profit,State_Florida,State_Newyork
0,185349.56,136897.44,201784.33,192261.11,0,0
1,182697.33,151377.55,243898.00,201792.01,1,0
2,183441.22,101145.11,217934.01,211050.00,0,1
3,174372.00,118671.00,183199.00,182901.00,0,0
4,172107.00,15391.77,166168.00,156187.00,0,1
5,188050.00,147398.00,301783.00,242050.00,1,0
6,198050.00,158098.00,351884.00,272050.00,1,0
7,208050.00,162050.00,364321.33,294080.00,0,1

In [87]:
dependent = dataset[["Profit"]]

In [88]:
independent = dataset[["Administration ","Marketing","R&D","State_Florida","State_Newyork"]]

In [89]:
from sklearn.model_selection import train_test_split

In [90]:
dependent

      Profit
0  192261.11
1  201792.01
2  211050.00
3  182901.00
4  156187.00
5  242050.00
6  272050.00
7  294080.00

In [91]:
x_train,x_test,y_train,y_test = train_test_split(independent,dependent,test_size=0.30,random_state=0)

In [92]:
x_train

   Administration   Marketing        R&D  State_Florida  State_Newyork
7        208050.00  162050.00  364321.33              0              1
3        174372.00  118671.00  183199.00              0              0
0        185349.56  136897.44  201784.33              0              0
5        188050.00  147398.00  301783.00              1              0
4        172107.00   15391.77  166168.00              0              1

In [93]:
x_test

   Administration   Marketing        R&D  State_Florida  State_Newyork
6        198050.00  158098.00  351884.00              1              0
2        183441.22  101145.11  217934.01              0              1
1        182697.33  151377.55  243898.00              1              0

In [94]:
y_train

      Profit
7  294080.00
3  182901.00
0  192261.11
5  242050.00
4  156187.00

In [95]:
y_test

      Profit
6  272050.00
2  211050.00
1  201792.01

In [96]:
from sklearn.linear_model import LinearRegression

In [97]:
LinearRegression()

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [98]:
regrossor = LinearRegression()

In [99]:
regrossor.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [100]:
regrossor.coef_

array([[-6.15353008e-01,  2.47677626e-01,  6.24196782e-01,
        -1.35689879e+04,  8.10287535e+03]])

In [101]:
regrossor.intercept_

array([146456.95693784])

In [102]:
Y_predict = regrossor.predict(x_test)

In [103]:
from sklearn.metrics import r2_score

In [104]:
r_score = r2_score(y_test,Y_predict)

In [105]:
r_score

0.9504878329779977

In [106]:
import pickle

In [108]:
load_data = pickle.dump(regrossor,open("MultipleRegression.sav",'wb'))